using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace EtheriT.Coker.Application.Shared.Dto.enumType.ThirdParty
{
    public enum LinePayErrorCodeEnum
    {
        買家不是LINEPay的用戶 = 1101,
        買方被停止交易 = 1102,
        此商家不存在 = 1104,
        此商家無法使用LINEPay = 1105,
        標頭_Header_資訊錯誤 = 1106,
        無法使用的信用卡 = 1110,
        金額錯誤_scale = 1124,
        付款帳戶狀態錯誤 = 1141,
        Balance餘額不足 = 1142,
        正在進行付款 = 1145,
        交易記錄不存在 = 1150,
        該transactionId的交易記錄已經存在 = 1152,
        付款request時的金額與申請confirm的金額不一致 = 1153,
        買家設定為自動付款的信用卡暫時無法使用 = 1154,
        交易編號不符合退款資格 = 1155,
        無付款申請資訊 = 1159,
        可退款日期已過無法退款 = 1163,
        超過退款額度 = 1164,
        已經退款而關閉的交易 = 1165,
        用來確認付款的資訊錯誤_請訪問LINEPay設置付款方式與密碼認證 = 1169,
        使用者帳戶的餘額有變動 = 1170,
        該訂單編號_orderId_的交易記錄已經存在 = 1172,
        超過允許查詢的交易數目_100筆 = 1177,
        商家不支援該貨幣 = 1178,
        無法處理的狀態 = 1179,
        付款時限已過 = 1180,
        付款金額不能小於0 = 1183,
        付款金額比付款申請時候的金額還大 = 1184,
        regKey不存在 = 1190,
        regKey已過期 = 1193,
        此商家無法使用自動付款 = 1194,
        已在處理使用regKey進行的付款 = 1197,
        API重覆呼叫_或者授權更新過程中_呼叫了CaptureAPI_請幾分鐘後重試一下 = 1198,
        內部請求錯誤 = 1199,
        一卡通MONEY相關錯誤 = 1264,
        信用卡付款時候發生了臨時錯誤 = 1280,
        信用卡付款錯誤 = 1281,
        信用卡授權錯誤 = 1282,
        因有異常交易疑慮暫停交易_請洽LINEPay客服確認 = 1283,
        暫時無法以信用卡付款 = 1284,
        信用卡資訊不完整 = 1285,
        信用卡付款資訊不正確 = 1286,
        信用卡已過期 = 1287,
        信用卡的額度不足 = 1288,
        超過信用卡付款金額上限 = 1289,
        超過一次性付款的額度 = 1290,
        此信用卡已被掛失 = 1291,
        此信用卡已被停卡 = 1292,
        信用卡驗證碼_CVN_無效 = 1293,
        此信用卡已被列入黑名單 = 1294,
        信用卡號無效 = 1295,
        無效的金額 = 1296,
        信用卡付款遭拒絕 = 1298,
        參數錯誤 = 2101,
        JSON資料格式錯誤 = 2102,
        內部錯誤 = 9000
    }
}
