using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace EtheriT.Coker.Application.Shared.Dto.enumType.ThirdParty
{
    public enum PChomePayErrorCodeEnum
    {
        APPID和Secret錯誤 = 10001,
        不被允許的IP位址 = 10002,
        token錯誤 = 10003,
        token逾期 = 10004,
        未設定notifyURL或returnURL = 10006,
        會員帳號無法使用功能服務 = 10007,
        訂單編號不可重複 = 20001,
        訂單不存在 = 20002,
        付款類別錯誤 = 20003,
        參數錯誤 = 20005,
        信用卡分期的商品金額須為30元以上 = 20006,
        目前無法查詢當日資料 = 20007,
        商品名稱超過字數限制 = 20008,
        請求格式不是JSON格式 = 20009,
        銀行代號或銀行帳戶不存在 = 20011,
        ATM銀行代碼錯誤 = 20013,
        未設定超商退貨門市 = 20014,
        建立拍錢包訂單失敗 = 20019,
        拍錢包收款尚未啟用 = 20020,
        拍錢包訂單金額超過上限 = 20022,
        移除記憶信用卡失敗 = 20025,
        ATM逾期錯誤 = 40001,
        會員帳號暫時無法此功使用 = 40003,
        餘額不足 = 40005,
        退款編號不可重複 = 50001,
        該筆訂單並未成功付款無法退款 = 50002,
        訂單編號不存在 = 50003,
        退款金額需大於0 = 50004,
        帳戶餘額不足以退款 = 50005,
        查無此退款編號之資料 = 50006,
        信用卡分期之退款只能全額退不支援部分退款 = 50007,
        ATM退款資訊未備齊請隔日再試 = 50009,
        訂單已失敗不可退款 = 50010,
        退款金額必須與訂單金額相同 = 50011,
        訂單已退款 = 50012,
        訂單目前不能退款 = 50013,
        訂單不支援此退款方式 = 50014,
        建立拍錢包退款失敗 = 50015,
        原付款行不支援退回原帳戶 = 50016,
        本行提領金額需大於1元,他行提領金額需大於等於11元 = 70001,
        提領金額超過可提領餘額 = 70003,
        提領金額超過本日提領額度上限 = 70004,
        提領銀行尚未設定 = 70005,
        該會員帳號暫時無法此功使用 = 70006,
        物流狀態錯誤 = 90001,
        物流狀態歷程不存在 = 90002,
        列印交寄單失敗 = 90004
    }
}
